experiment-finetuned/all_finetuned/runs/Cylinder/3/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // Block 0 - upstream region
    (0    0    0)   // 0
    (0    0    0.1) // 1
    (0.1  0    0)   // 2
    (0.1  0    0.1) // 3
    (0    0.1  0)   // 4
    (0    0.1  0.1) // 5
    (0.1  0.1  0)   // 6
    (0.1  0.1  0.1) // 7

    // Block 1 - downstream region
    (0.1  0    0)   // 8
    (0.1  0    0.1) // 9
    (0.2  0    0)   // 10
    (0.2  0    0.1) // 11
    (0.1  0.1  0)   // 12
    (0.1  0.1  0.1) // 13
    (0.2  0.1  0)   // 14
    (0.2  0.1  0.1) // 15

    // Block 2 - top region
    (0    0.1  0)   // 16
    (0    0.1  0.1) // 17
    (0.1  0.1  0)   // 18
    (0.1  0.1  0.1) // 19
    (0    0.2  0)   // 20
    (0    0.2  0.1) // 21
    (0.1  0.2  0)   // 22
    (0.1  0.2  0.1) // 23

    // Block 3 - bottom region
    (0    0    0)   // 24
    (0    0    0.1) // 25
    (0.1  0    0)   // 26
    (0.1  0    0.1) // 27
    (0    0.1  0)   // 28
    (0    0.1  0.1) // 29
    (0.1  0.1  0)   // 30
    (0.1  0.1  0.1) // 31

    // Block 4 - cylinder region
    (0.05 0.05 0)   // 32
    (0.05 0.05 0.1) // 33
    (0.15 0.05 0)   // 34
    (0.15 0.05 0.1) // 35
    (0.05 0.15 0)   // 36
    (0.05 0.15 0.1) // 37
    (0.15 0.15 0)   // 38
    (0.15 0.15 0.1) // 39
);

blocks
(
    hex (0 2 6 4 1 3 7 5) (20 20 1) simpleGrading (1 1 1)
    hex (8 10 14 12 9 11 15 13) (20 20 1) simpleGrading (1 1 1)
    hex (16 18 22 20 17 19 23 21) (20 20 1) simpleGrading (1 1 1)
    hex (24 26 30 28 25 27 31 29) (20 20 1) simpleGrading (1 1 1)
    hex (32 34 38 36 33 35 39 37) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 5 1)
            (24 28 29 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 14 15 11)
        );
    }
    top
    {
        type wall;
        faces
        (
            (20 21 23 22)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (28 29 31 30)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (32 33 35 34)
            (36 37 39 38)
        );
    }
    defaultFaces
    {
        type empty;
        faces
        (
            (0 2 6 4)
            (1 3 7 5)
            (8 10 14 12)
            (9 11 15 13)
            (16 18 22 20)
            (17 19 23 21)
            (24 26 30 28)
            (25 27 31 29)
            (32 34 38 36)
            (33 35 39 37)
            (2 6 7 3)
            (26 30 31 27)
            (4 6 7 5)
            (28 30 31 29)
            (18 22 23 19)
            (30 34 35 31)
            (36 38 39 37)
            (34 38 39 35)
            (32 36 37 33)
            (32 34 35 33)
            (36 38 39 37)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //